{
  "revyoome": {
    "about": "RevyooMe is a new startup in downtown Guelph specializing in mobile development. The company was started in 2018 by Mark Graham and set out to develop a mobile app to connect reviews with a social media platform. During my summer at RevyooMe, the company was very small with only five employees, including myself. It consisted of a tech lead, two Android developers, and two iOS developers. The app has not been finished, but Revyoome is hoping to launch an Alpha build sometime this fall and release the app to the public by the new year.",
    "acknowledgements": "I would like to thank my Tech Lead, Dalton Polhill for all the help and knowledge he provided throughout the semester, as well as the Project Owner Mark Graham for hiring me to be a part of the amazing team at RevyooMe. I would also like to thank my academic advisor Greg Klotz, as well as my co-op coordinators Laura Gatto and Kate McRoberts for all the help they offered throughout the semester.",
    "conclusions": "In conclusion, this work term was an amazing experience for me. The ability to jump right in to an app in progress and immediately make significant contributions is something that felt very rewarding. I also gained lots of great experience as I learned a lot about using Slack, Git, scrum boards, and a ticket system in a work environment. This co-op was also amazing in helping me improve as a programmer. Learning the ins and outs of a new language from scratch has greatly improved not only my programming skills, but my critical thinking skills as well. I also learned a lot by using XCode to integrate the Swift code with UI design. Using XCode I was able to create storyboards with all the elements of a view in the app, and connect those elements to the code. This was a great way for me to improve my design skills as well as my proficiency of developing apps for iOS. I also was able to improve my teamwork skills, as working at RevyooMe allowed me to work as a part of a team in a way I haven't before at school. Working closely with my tech lead, the Android development team, and the rest of the iOS team was an amazing experience. I was able to assist teammates when they  were stuck, as well as get the same assistance to broaden my knowledge and understanding of difficult topics. This also allowed me to improve my communication skills as communicating with my team members and tech lead was a big part of this role. Overall this work term was an amazing opportunity and my Software Engineering skills have improved greatly. This invaluable work experience will translate to all my future work, in both school and as a professional Software Engineer.",
    "learningGoals": {
      "Teamwork": "This summer, I want to improve my ability to work with team members on the same software project. To achieve this I will work closely with my team members by engaging in team tasks and ensuring I deliver high quality work to the team. I will know that I have improved my teamwork skills if the tasks I complete within my team are successful. I think I really improved my teamwork skills over this past summer. I was able to gain a lot of experience and knowledge working with my co-workers, and ended up completing many successful group tasks. For example, when my partner and I had to implement a video-cropping editor to the app, we collaborated to brainstorm ideas of how to implement and build the editor together.",
      "Problem Solving": "I want to improve my problem-solving skills when I get stuck on something I have never done. I have never programmed in Swift before so I expect there to be lots of problems for me to solve. Whenever I have a challenging task to complete, I will do my best to come up with a creative solution to solve the problem in the best way possible. I will make sure to weigh all my options to ensure I pick the best one. I will know that I've improved my problem-solving skills once I am able to solve challenging tasks in shorter amounts of time by using the best solution possible. I will improve this skill day by day, as I am facing new challenges every day at work. This summer I was very successful in improving my problem-solving skills. At the beginning of my work term, I struggled to find the best solutions to the challenging tasks I faced. However, as the semester went on, I found it much easier to solve these difficult tasks than I had at the beginning. I improved this skill by learning how to use Google more efficiently, as well as by getting better at using official documentation.",
      "Depth and Breadth of Understanding": "I would like to be proficient in the Swift programming language. All of the code I am writing at my job is in Swift, which I have never used before. To achieve this, I will watch videos, read articles and examine code to help me learn Swift. I will also make sure to ask questions to more experienced programmers at work so I can understand the language better. I will measure my progress by the quality of the code that I produce. By the end of the summer, I would also like to be able to create iOS apps on my own using Swift. This summer I made a huge improvement in my knowledge of Swift. Going into the semester, I had never programmed in Swift before, but after reading lots of documentation and watching videos, I greatly improved my ability. I increased my new skills even further at work by looking at the old codebase and reading the code, comments and functions to understand the language on a base level. By working on difficult tasks in Swift throughout the semester, I was able to greatly improve my skills and understanding of the language and now am very confident in being able to code a full app on my own."
    },
    "reflection": "I think I was successful in completing all of my learning goals. During the semester I did a great job developing my problem solving, knowledge and understanding and teamwork skills a lot. All three of my goals were very realistic in terms of my actual job, as I was presented with many opportunities to work with a team, solve challenging tasks, and learn new things about programming and Swift. These skills will translate very well to my next job. The teamwork skills are very important since I will be working on a team, the problem solving skills are useful since I will have many tough programming challenges I have to face, and my understanding skills will also be a lot better, which I will need to use to learn new languages and technologies. This summer I was super excited to work with Swift and XCode, as I have always been interested in developing an iPhone app, and this experience allowed to me to explore that. Overall, I am very happy with my work term, as I accomplished all of my learning goals. The invaluable experience at RevyooMe has allowed me to grow as a Software Engineer, and will translate to my classes, as well as my future work terms."
  },
  "tekside": {
    "about": "",
    "acknowledgements": "",
    "conclusions": "",
    "learningGoals": {},
    "reflection": ""
  },
  "wsib": {
    "about": "",
    "acknowledgements": "",
    "conclusions": "",
    "learningGoals": {},
    "reflection": ""
  }
}