{
  "revyoome": {
    "name": "RevyooMe",
    "about": "RevyooMe is a new startup in downtown Guelph specializing in mobile development. The company was started in 2018 by Mark Graham and set out to develop a mobile app to connect reviews with a social media platform. During my summer at RevyooMe, the company was very small with only five employees, including myself. It consisted of a tech lead, two Android developers, and two iOS developers. The app has not been finished, but Revyoome is hoping to launch an Alpha build sometime this fall and release the app to the public by the new year.",
    "acknowledgements": "I would like to thank my Tech Lead, Dalton Polhill for all the help and knowledge he provided throughout the semester, as well as the Project Owner Mark Graham for hiring me to be a part of the amazing team at RevyooMe. I would also like to thank my academic advisor Greg Klotz, as well as my co-op coordinators Laura Gatto and Kate McRoberts for all the help they offered throughout the semester.",
    "conclusions": "In conclusion, this work term was an amazing experience for me. The ability to jump right in to an app in progress and immediately make significant contributions is something that felt very rewarding. I also gained lots of great experience as I learned a lot about using Slack, Git, scrum boards, and a ticket system in a work environment. This co-op was also amazing in helping me improve as a programmer. Learning the ins and outs of a new language from scratch has greatly improved not only my programming skills, but my critical thinking skills as well. I also learned a lot by using XCode to integrate the Swift code with UI design. Using XCode I was able to create storyboards with all the elements of a view in the app, and connect those elements to the code. This was a great way for me to improve my design skills as well as my proficiency of developing apps for iOS. I also was able to improve my teamwork skills, as working at RevyooMe allowed me to work as a part of a team in a way I haven't before at school. Working closely with my tech lead, the Android development team, and the rest of the iOS team was an amazing experience. I was able to assist teammates when they  were stuck, as well as get the same assistance to broaden my knowledge and understanding of difficult topics. This also allowed me to improve my communication skills as communicating with my team members and tech lead was a big part of this role. Overall this work term was an amazing opportunity and my Software Engineering skills have improved greatly. This invaluable work experience will translate to all my future work, in both school and as a professional Software Engineer.",
    "learningGoals": {
      "Teamwork": "This summer, I want to improve my ability to work with team members on the same software project. To achieve this I will work closely with my team members by engaging in team tasks and ensuring I deliver high quality work to the team. I will know that I have improved my teamwork skills if the tasks I complete within my team are successful. I think I really improved my teamwork skills over this past summer. I was able to gain a lot of experience and knowledge working with my co-workers, and ended up completing many successful group tasks. For example, when my partner and I had to implement a video-cropping editor to the app, we collaborated to brainstorm ideas of how to implement and build the editor together.",
      "Problem Solving": "I want to improve my problem-solving skills when I get stuck on something I have never done. I have never programmed in Swift before so I expect there to be lots of problems for me to solve. Whenever I have a challenging task to complete, I will do my best to come up with a creative solution to solve the problem in the best way possible. I will make sure to weigh all my options to ensure I pick the best one. I will know that I've improved my problem-solving skills once I am able to solve challenging tasks in shorter amounts of time by using the best solution possible. I will improve this skill day by day, as I am facing new challenges every day at work. This summer I was very successful in improving my problem-solving skills. At the beginning of my work term, I struggled to find the best solutions to the challenging tasks I faced. However, as the semester went on, I found it much easier to solve these difficult tasks than I had at the beginning. I improved this skill by learning how to use Google more efficiently, as well as by getting better at using official documentation.",
      "Depth and Breadth of Understanding": "I would like to be proficient in the Swift programming language. All of the code I am writing at my job is in Swift, which I have never used before. To achieve this, I will watch videos, read articles and examine code to help me learn Swift. I will also make sure to ask questions to more experienced programmers at work so I can understand the language better. I will measure my progress by the quality of the code that I produce. By the end of the summer, I would also like to be able to create iOS apps on my own using Swift. This summer I made a huge improvement in my knowledge of Swift. Going into the semester, I had never programmed in Swift before, but after reading lots of documentation and watching videos, I greatly improved my ability. I increased my new skills even further at work by looking at the old codebase and reading the code, comments and functions to understand the language on a base level. By working on difficult tasks in Swift throughout the semester, I was able to greatly improve my skills and understanding of the language and now am very confident in being able to code a full app on my own."
    },
    "reflection": "I think I was successful in completing all of my learning goals. During the semester I did a great job developing my problem solving, knowledge and understanding and teamwork skills a lot. All three of my goals were very realistic in terms of my actual job, as I was presented with many opportunities to work with a team, solve challenging tasks, and learn new things about programming and Swift. These skills will translate very well to my next job. The teamwork skills are very important since I will be working on a team, the problem solving skills are useful since I will have many tough programming challenges I have to face, and my understanding skills will also be a lot better, which I will need to use to learn new languages and technologies. This summer I was super excited to work with Swift and XCode, as I have always been interested in developing an iPhone app, and this experience allowed to me to explore that. Overall, I am very happy with my work term, as I accomplished all of my learning goals. The invaluable experience at RevyooMe has allowed me to grow as a Software Engineer, and will translate to my classes, as well as my future work terms."
  },
  "tekside": {
    "name": "Tekside.io",
    "about": "Tekside.io is a spin-off venture from Canada’s leading email marketing agency, Inbox Marketer. Combining a deep specialization in email with veteran DevOps knowledge, they help you get more from your marketing ecosystem. Located in Canada’s Tech triangle, Tekside.io brings together 25 experienced Programmers, Developers and Data Scientists into an agile, performance focused Team. Tekside.io is located in downtown Guelph, and does a large range of work for it's clients including creating custom software, apps and landing pages, as well as data management and analyzation. One of Tekside.io's main focuses is creating software to send mass marketing emails on behalf of it's clients. This software is implemented in many ways ranging from the use of microservices to stand alone programs.",
    "acknowledgements": "I would like to thank my supervisor David Brooks for all the expertise he gave me over the course of the semester, as well as Peter Awad for hiring me to be a part of the wonderful team at Tekside.io. Also a special thanks to my co-workers Steven Low and Akshit Tripathi for helping me with the design of this website. I would also like to thank my academic advisor Greg Klotz, as well as my co-op coordinators Laura Gatto and Kate McRoberts for all the help they offered throughout the semester.",
    "conclusions": "In conclusion, this work term was an amazing experience for me. I gained a lot of valuable programming experience during my term at Tekside.io that will carry over to both school and future work terms. I was given the opportunity to build lots of large applications both for clients and for internal projects by using lots of new and complex technologies. Having a lot of my own code in production is very rewarding and I was very glad I could make valuable contributions to Tekside.io during my co-op period. Over the course of the work term, I built many full applications that are much more complex than anything I've build before, such as a fully automated end to end testing software, as well as re-factoring a logging library that is being used across all the javascript programs in production. Before this work term I found it very difficult to learn new APIs and implement them into my program, sometimes taking over a week for one API. However over the course of the last four months I learned many many APIs and am able to understand and implement them in under a day, for example near the end of my work term I wrote a program using an external API to parse User Agents. I was able to use and understand the library much more easily due to all the experience I gained at Tekside.io. Another valuable takeaway from this work term was all the expertise and guidance I received at the company. I had the privilege of working together with lots of excellent developers who helped me improve and grow as a programmer. Working together with the other devs at Tekside.io allowed me to improve not only my programming skills but my teamwork and communication skills as well. Over the course of my fall work term at Tekside.io, I learned many skills that will be very useful in my future at both school and in the workforce. This amazing experience has helped me grow as a software engineer and I can't wait to use it in the future.",
    "learningGoals": {
      "Teamwork": "During this co-op I will be a part of a larger team than I have ever worked with before. I hope to use this new experience to apply my teamwork skills from past projects, as well as improve them. To achieve this goal, I will make sure I am always communicating any difficulties I come across with my teammates, as well as make myself available for any questions they may have about my work or the project we are working on. I will know that I have successfully improved my teamwork skills by the amount I am able to contribute during pair programming and team discussions. Over the course of the semester, I think I have greatly improved my teamwork skills, especially my pair programming skills. Throughout my work term, I did a lot of pair programming with the senior developers, the junior developers and the other co-op student. This gave me a wide variety of experience working in different roles and teams, as I was able to work together with my co-workers to produce high quality code.",
      "Oral Communication": "During this work term, I want to improve my communication skills. Since I am in a larger team than my last work term, I would like to work on communicating with a much larger team. To accomplish this goal, I will make sure I always communicate my current task well during the daily standup meeting. I will also make sure to always make myself available for people to ask me questions, both in person and through slack and email. I will know that I have successfully completed this goal by making sure that my team members are comfortable asking me questions, and are confident in their understanding of my answers.This semester, I had lots of opportunity to use and improve my oral communication skills, and I think they have improved greatly. Each morning I made sure to communicate my update well at the daily scrum meeting, and I spent a lot of time working and communicating closely with my teammates throughout the semester. By doing so, I feel like I've greatly improved my oral communcation skills.",
      "Technological Literacy": "This work term, I would like to be more comfortable with the types of technology used in the industry. This includes software such as Docker, Jenkins, Slack and RabbitMQ and more. To accomplish this goal, I will learn the basics of each software on my own. By using them at work, I should improve my abilities through experience. I will also be able to improve these skills by asking my co-workers for help if I face a task with these I haven't completed before. I will know that I have been successful if by the end of my work term I can comfortably and confidently use more software and technology that is relevant to the field of Software Engineering than I could at the beginning of the semester.After this semester, I feel much more comfortable both learning and using new technologies in the industry. In the past learning a new API was difficult for me, but now I feel confident learning and using a new API in only a matter of hours. I also had to learn lots of new technologies. This experience will be very useful in the rest as my career as after this work term I am able to understand and learn how to use them correctly much more easily."
    },
    "reflection": "My goal for this semester was to improve my teamwork and oral communication skills, as well as my technological literacy. All three of these goals were related to my job tasks, as I had a lot of team based work which allowed me to improve my teamwork skills as well as my oral communication skills. The tasks I were given also involved a lot of learning new technologies such as RabbitMQ, Portainer and MySQL, which allowed me to achieve my learning goals. These skills I learned at this job will be very useful in the future, as now that I have experience working in a large dev team with new technologies, I should be able to become accustomed to any workplace I find myself in. Before I started at Tekside.io, I really wanted to improve my database skills, as that was something I did not learn a lot at school. Over the course of the semester, I became very familiar with both MySQL and MsSQL as I used both almost daily. These skills will be very useful in the future as databases are a very important part of the industry and these skills will definitely be relevant for me in my future endeavours. Overall, I think I was very successful in completing my learning goals. All three were realistic and were skills I was able to continue to improve over the course of my work term at Tekside.io."
  },
  "wsib": {
    "name": "WSIB Innovation Lab",
    "about": "The WSIB Innovation lab is an outpost of the Workplace Safety Insurance Board, located in the Communitech building in Waterloo, Ontario. The WSIB provides workers compensation for injuries. At the lab, they focus on research and development to find innovative solutions to increase injury prevention, enhance healing, and increase customer satisfaction. This research includes very interesting new technology and ideas, such as wearables, machine learning, the internet of things and A.I. The lab has many projects in progress, including a tool to help measure noise induced hearing loss and an app to help reduce symptoms of PTSD.",
    "acknowledgements": "",
    "conclusions": "",
    "learningGoals": {},
    "reflection": ""
  }
}